Revit 2027 API
Line.Direction Property
Returns the direction of the line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Direction { get; }
Public ReadOnly Property Direction As XYZ
	Get
public:
property XYZ^ Direction {
	XYZ^ get ();
}
member Direction : XYZ with get
Property Value
XYZ
See Also
Reference
Line Class
Autodesk.Revit.DB Namespace